{
  "meta": {
    "title": "Carlos GB - Ingeniero de Software | Portfolio",
    "description": "Carlos Garnacho, ingeniero de software especializado en React, JavaScript y Node.js. Explora mis proyectos y experiencia en desarrollo web moderno.",
    "keywords": "Carlos Garnacho, desarrollador web, ingeniero de software, React, JavaScript, Node.js, portfolio, programador, desarrollo web"
  },
  "header": {
    "jobTitle": "Ingeniero de Software",
    "navigation": {
      "about": "Sobre mí",
      "experience": "Experiencia",
      "education": "Educación",
      "certificates": "Certificados",
      "idioms": "Idiomas"
    }
  },
  "about": {
    "title": "Sobre mí",
    "paragraph1": "Soy Carlos Garnacho Benito, miembro de una preciosa familia de 4 👨👩🧒👧.",
    "paragraph2": "Intento de futbolista, amante de la tecnología y amigo de mis amigos. Me gusta disfrutar de la vida y aprender cosas nuevas cada día. Me encanta viajar y conocer nuevas culturas, siempre con una sonrisa en el rostro.",
    "paragraph3": "También, ingeniero de software apasionado por la tecnología y la innovación. Me especializo en crear aplicaciones web modernas y eficientes utilizando las últimas tecnologías como React, JavaScript, TypeScript y Node.js. Con experiencia en desarrollo tanto frontend como backend, me enfoco en crear soluciones escalables que brinden una excelente experiencia de usuario. Mi objetivo es transformar ideas en aplicaciones web funcionales y atractivas."
  },
  "experience": {
    "title": "Experiencia Profesional",
    "jobs": [
      {
        "period": "2022 - Presente",
        "position": "Ingeniero de Software",
        "company": "eDreams ODIGEO",
        "duration": "Octubre 2022 - Presente",
        "description": "Trabajando como ingeniero de software desarrollando y manteniendo soluciones tecnológicas de viajes. Contribuyendo al desarrollo de aplicaciones web escalables utilizando tecnologías modernas como React, TypeScript y Node.js. Colaborando con equipos multifuncionales para entregar soluciones de software de alta calidad para millones de usuarios en todo el mundo.",
        "technologies": ["React", "TypeScript", "Node.js", "JavaScript"]
      },
      {
        "period": "2016 - 2022",
        "position": "Desarrollador de Software",
        "company": "Kisters AG",
        "duration": "2016 - 2022",
        "description": "Desarrollé y mantuve soluciones de software para sistemas de gestión ambiental y energética. Trabajé en proyectos complejos de visualización de datos y contribuí al desarrollo de aplicaciones de nivel empresarial. Adquirí amplia experiencia en desarrollo full-stack e integración de sistemas.",
        "technologies": ["JavaScript", "Java", "SQL", "Desarrollo Web"]
      }
    ]
  },
  "contact": {
    "title": "Contacto",
    "subtitle": "¿Tienes un proyecto en mente? ¡Me encantaría saber más sobre él!",
    "form": {
      "name": {
        "label": "Nombre completo:",
        "help": "Ingresa tu nombre completo"
      },
      "email": {
        "label": "Correo electrónico:",
        "help": "Ingresa un email válido"
      },
      "message": {
        "label": "Mensaje:",
        "help": "Cuéntame sobre tu proyecto o consulta"
      },
      "submit": "Enviar mensaje"
    }
  },
  "footer": {
    "copyright": "&copy; {year} Carlos Garnacho Benito",
    "github": "Perfil de GitHub de Carlos Garnacho Benito",
    "linkedin": "Perfil de LinkedIn de Carlos Garnacho Benito"
  }
}
